#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-yLEcusvC41YZUoAY

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=external_composer_syslog]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_security_group.external_workers: Refreshing state... [id=sg-0f578bf2872026f5d]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_security_group.external_vpc_endpoints: Refreshing state... [id=sg-0be443e4c92c98b1c]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20201204204656576600000006]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=internal_composer_syslog]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20201204204656609900000007]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20201204204656723700000009]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_staging]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_staging]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_security_group.external_composer: Refreshing state... [id=sg-0be4cfbfac3cc0022]
aws_vpc_endpoint.external_vpc_cloudwatch_logs: Refreshing state... [id=vpce-0ffb71834c608a4e5]
aws_vpc_endpoint.external_vpc_secretsmanager: Refreshing state... [id=vpce-013676c2939c3d681]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0d13154306549b1cd]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-01e031ba5033ab0c5]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_staging-20210113202541907800000001]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_staging-20210113203644009900000001]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_staging-20210113203644029600000002]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_staging-20210113202541913700000002]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-0daeecfc25da04a05]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_network_interface.composer_external: Refreshing state... [id=eni-02f250427cdd85dc7]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_instance.composer_external: Refreshing state... [id=i-006c1b00085972e8d]
aws_instance.composer_internal: Refreshing state... [id=i-04fa20b9e3f3d85d1]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-3224493979]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-4047416848]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0aae9d85fdd3f7067]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-04e6df10bd74694e7]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-cf5c32a2-3323-4b02-afa2-f90656c49b72]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-3ffc1651-26ac-4b37-a956-3bd24643f4dc]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_launch_template.worker_external_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_external_x86" {
      ~ default_version         = 8 -> (known after apply)
        id                      = "lt-04e6df10bd74694e7"
      ~ latest_version          = 8 -> (known after apply)
        name                    = "imagebuilder_worker_external_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 External Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9RYW5PiOJZ+J6L+gze7I3Y3agFfMCQ5nR2DweZqGcuWfJndyPBFYGNhO21x7a7/vgFJ1mRlZc/0xPRL84Skc3SOvvj0nSMPi5yRnDXtU0keuO2OsrQMKtbepkcS/4ULi10eB9Xp8U6f6qpiIDAaQO+ucRk1ManqtMgfOKHFf2p8ajSbb40+NV73HqV1WdQpu9oGjAVRsiU5+wu3SinJgy15vEvzlLWi1fru7152FeT1ilRNNY+KOM3XD1wvTNkbg2vKjBxZO6LFLm5GRb5K158aerol3yX3w1ubRmNXk6p+aHBck7tk8MCRSGxeJhscx3F1nTwFO5YUVXom8VNGTlfby6/J3dV10qzqgBsMBgNFAudgKJwiUb0MRwNzoAwGg+HAHB43K206pePVMO+nEZ2ctk6lKpWNRLrosswa2wIpe/FweT4IG6/r5IlJl65ekmWVgiNw6fg+cox+G2qlEvPnvnYAp8/Zap30V7sT8Dr96Wc96BonGytrOQGFdlxBdyynExa1LZPmoaql89LKOjQti47pM4Vt14PndWYNuqNzclqH3Z2s99OjPT12HGWzs3R+7JpnsCnJ6pQ6u8/1FH5ORFSZ2Xyg7HZTzwyrDf2sJXgbLPbV/mQb4q422D73lE0SLg8noyc6y01QzuN2P7GD56UqHLRTF2li7kad5frAr1Mz7NZpqNnnHrDJ0ZFks3//XJqGo3vzqFz7FbWCyWTuW3rCzkZPj/3KWGjILSxhQAanzjphEagMxaahbO2XPel85p8VqInR0OgY/KGUD4fnZbI/iDkLpdJeLFlM2OwzlnlzmZe5e7Ks3C/Fs3aIiCiE7rHby5M+zZNF5a83pBcVZr4caMd2RKWuas1O63S3jJTD50y493bU0130HCgsO8wWGdyMyo3tikTWZ0K3GPXq2STqtB05O60W+1ivcRI/C0N3MsbYKM/FOuT7MvZSHrpamfuwLRC8HrbhZwefmLfy7vlqhY0oHhTi2F/lM/nsQeTOZn3dz4L8eJTUHjLSTJ2Bfo02Is+fu8PTiZ+ups92OBMUedVbxVIQwWrRGUUeirVpW1BOwOlqwqYX+elgbMzmIDy7Gm9LbHV/5IlgPj5y22BTVH+tSJwErBUV27tv+U5iUZaF/pXzwxfOU380FYCtype56VIRNhrtlF3NVtLjxO4ejKzr3uebtt8jxRKYalvnD/POvTzninAXB+k3wRqHKmXk6aIIt2tZBix54NpsW75c76eLRjztg6q+Zha9qMAD9+stUcNS0HQxehoauj61H++lKFjd8zyRRVnshB2hs+qt5HAlB4SPpagviNF9X+iLN++hoS8NS4Wv7v1QjOWuLHfknixK0n2vI4QSEQMSrO57UrdHRCm4F+PO++CDp6EK7ceFxbOFJQwhimd2qowgniEL+TOT1xC8rvFsmAkzC0EVq2BkOr7r85pkoZni8xSjETB10TsDrIxRJguh6PNkq8v2KBPhOEGhCJWYh9BB5SIUylkw8Td2pkGIDnOTakrM+88QY2BmdGLaGoZIk2L+mOq8XPpaXEdCOQKuvwkdIFnjZGNnwrPpxkus4q6NoU+QoGIbuMEYGLZbKvGhvKx1vlnLNNfGMxjzOHcQdBDWVKhqfLzVT9ZGS7CUVPaYlwkuuyYPFMRTCWqab2Vs72S0iLfAGF5zng0R0lRfjDWkaurV1umPLmMz04CZK5WDNc/CQPfOycJxSoAwzUmuQAMBRRdmC30bT+FIOXqudo4367mHZxuc6SKguuxnyREidAzQETvqvaSPZpBs8DkQy0KXyqM9oRO0SSREvf1CBDPdmR6jjYIJLm2PPwa6EEkYlyfzUPBgBLeeVJxtl3ZCDXSxgH0kKLmZ0UUwjhVjorGIlpbu9LeeA09kgi17yM5h5quWwzq6FFXeWZv7GO/0Lah1LS6HFPPOaDaBgj+CNAa2qO39DFaOhkcwxwtrEs+RE4/tCTxbKggcB2xjGjuWVgYg63RiPj7oVAsceyp750QIXeVZx4M5Uv3aUfWOP9YCWxUSR6MptBVgudDRVTC1ckWCPD14Od2FmKJwyM4wx2I4gns8Fk5kUuyJm3QjFYo4E5ZRps1Cs+yEYi1FFDM8wRkcYw0Js6EtxoqOmOAhwcITnFiuAsPzLAsl/zg/D45w651N1DlhBJSYx4rpaAZWhTF04ynCVB1S39LV/tCkVINZIfm27+lSdvDH/Tqy+nOP+qWX0TIW4Q4JgwpkwtBQY0XHOLPcGDpIGHpIG1ubmAK6PhNbyULxMP8NX+XVF7qxZqZ9CSEfmEgYmo7X+fheHb9y1FyXCsxLEYiUWnwkh1q5iLLpyXaEIFC1o6VSnTjHxJaoE9mRBM90aOMZgjk4ODni9clUggKUPB4W8XYtQAT2lqalw+2xim3FA6jv+TwUnQkYRuP+2JrMRF1lS8s52kDAc931DmBc7y1Kc2cSVeG4RHii7w23PISbxMLbI4smaA95YWnbaI6c2QQNmRFscBCd8RbyvhuoHcm2pwJyGDZGs3k4SaiVaTVyk6kpHkdojDsoA8CzNRm4AwmP5dwYKQuLxjzBimmYJY/EGJj5QAIYW75zzwOEOkgtT1Y+OAcTugfarGPgGYQiOxEHWJYbb80sEQMpAdbW30WiLjlWXwQOFeAmYUQVusMN4L2skOd8KUOkCdakOHpZLEQIeHNJmyMMUTzsw/DsneIsdj2UyUjwFx7VOx5OdPM8M0CubQJndow2qONvoGpl5tzKQW1b91I0AXK00fbAhbyXzXaAZoLp6v1h+qLJEMnqVAUaonAGMzoyMdRetJyfv68UE8OyH4NDfSlgZVGTqlXU4S6lcauo1u+NB6MRVC3rUeiJLUlodTstQbjZOAacq/DJshZPc9WzngYQPAZV/hAc6oeaRBVh9TbIgzWpHnZ1kwQ1awoPfUnqyaLQ7/X7/ZvVQ02qfRqRa7vanIpjySluISykWEM4XdpTAzzpAzAY3yrdAIz+jXi7sI6qtLw09s2bSzMqttsgj5uZ6dGi/xrfs2xVvyIGBrr6WLNgnebrJjkyUuUBbR6KKiNV3fq9cI6m8LFNWNS+2TRfnV4DqkOo2tbXs6pgtDSmwH5CcPGYMFbWD+32t4dtfT1sK9gG5yK/5dJ+2418FPK7iRYrtvTjJuVvWbFJ/+82CCgtDiR+iottkOY198j9jbtjJNi+Pfnd/3B3yS5shRU5vJ9/Qe37Je41QhRwj9zdx1lHQTOqWKskl+7rlt3Lhv9yfn9YHr/9hvxXXoPHZp0QSl+4+VvPwf9oh2neDoM6adSEcU2yK7gyLckqSGmjLnZVRD5uPhskSgruziKMpfmaq081I1suKWp2eUi27hqNHziLMI4l5LvFxuu/iFGuJqz5OuZ+fHdF/lRQvOhAeIEjzWsW5BHhWMHBCXiBA5J1WjNSXTH5anFIWXK1abR3ddWmRRTQaybBoea+vZvcmrDmy1RzH9Ad4f73citfp9KY+/GXf6ZxX7hfuc0z16y4u5Z19bNYlebrO+7nl9O9lbOnW+Cnm5y1NnWRN17d/5Hl3e/cjPuVuyJebbnm6vcm0PhIcm+fVLhmM9ix4s9EnBEpaXHiLvWKWxUV91oFrqS5LV4o86oV3HDARaRi6SqNAkZajTCoSbfDNWOuyf3000/cj7+8e4h94X7mfvzlbdn48kZwfitMRk5ckMffxvpDSPpBrf+nvHxB5VrVv6Xh3xfuPrZ84dhXhL6H4sWhmZHTFY53G0cV+zc3fsX5Dcm/O82fj6/XOnZR7g9Ye1H+XfnGpPEDZxsj47+2SXCKSf7fD5xDuJyQ+KKQUZHvSXWpFWl9GY+AxdHgopSHhOTcgXA02OVR0mpEAbsy/O4N0ree8stb9C/148sd9/PPb1P4E0H8WlZ35Q1X7tbV3vBdVqQMKsK9byP+s+Yqsi0Yee92vch1EWWE1a3GS0G+VF+SByElXLOZF4evu71scetG//oe1of7Hs9/B2az+anx/wEAAP//wcby5UYXAAA=" -> "H4sIAAAAAAAA/9RYW5PiOJZ+J6L+gze7I3Y3agFfMCQ5nR2DweZqGcuWfJndyPBFYGNhO21x7a7/vgFJ1mRlZe/07PRL84Skc3SOPj5954hhkTOSs6Z9KskDt91RlpZBxdrb9Ejiv3BhscvjoDo93ulTXVUMBEYD6N01LqMmJlWdFvkDJ7T4T41PjWbzrdGnxuveo7QuizplV9uAsSBKtiRnf+FWKSV5sCWPd2mesla0Wt/93cuugrxekaqp5lERp/n6geuFKXtjcE2ZkSNrR7TYxc2oyFfp+lNDT7fku+R+eGvTaOxqUtUPDY5rcpcMHjgSic3LZIPjOK6uk6dgx5KiSs8kfsrI6Wp7+TS5u7pOmlUdcIPBYKBI4BwMhVMkqpfhaGAOlMFgMByYw+NmpU2ndLwa5v00opPT1qlUpbKRSBddllljWyBlLx4uzwdh43WdPDHp0tVLsqxScAQuHd9HjtFvQ61UYv7c1w7g9DlbrZP+ancCXqc//awHXeNkY2UtJ6DQjivojuV0wqK2ZdI8VLV0XlpZh6Zl0TF9prDtevC8zqxBd3ROTuuwu5P1fnq0p8eOo2x2ls6PXfMMNiVZnVJn97mews+JiCozmw+U3W7qmWG1oZ+1BG+Dxb7an2xD3NUG2+eesknC5eFk9ERnuQnKedzuJ3bwvFSFg3bqIk3M3aizXB/4dWqG3ToNNfvcAzY5OpJs9u+fS9NwdG8elWu/olYwmcx9S0/Y2ejpsV8ZCw25hSUMyODUWScsApWh2DSUrf2yJ53P/LMCNTEaGh2DP5Ty4fC8TPYHMWehVNqLJYsJm33GMm8u8zJ3T5aV+6V41g4REYXQPXZ7edKnebKo/PWG9KLCzJcD7diOqNRVrdlpne6WkXL4nAn33o56uoueA4Vlh9kig5tRubFdkcj6TOgWo149m0SdtiNnp9ViH+s1TuJnYehOxhgb5blYh3xfxl7KQ1crcx+2BYLXwzb87OAT81bePV+tsBHFg0Ic+6t8Jp89iNzZrK/7WZAfj5LaQ0aaqTPQr9FG5Plzd3g68dPV9NkOZ4Iir3qrWAoiWC06o8hDsTZtC8oJOF1N2PQiPx2MjdkchGdX422Jre6PPBHMx0duG2yK6q8ViZOAtaJie/ct30ksyrLQv3J++MJ56o+mArBV+TI3XSrCRqOdsqvZSnqc2N2DkXXd+3zT9nukWAJTbev8Yd65l+dcEe7iIP0mWONQpYw8XRThdi3LgCUPXJtty5fr/XTRiKd9UNXXzKIXFXjgfr0lalgKmi5GT0ND16f2470UBat7nieyKIudsCN0Vr2VHK7kgPCxFPUFMbrvC33x5j009KVhqfDVvR+KsdyV5Y7ck0VJuu91hFAiYkCC1X1P6vaIKAX3Ytx5H3zwNFSh/biweLawhCFE8cxOlRHEM2Qhf2byGoLXNZ4NM2FmIahiFYxMx3d9XpMsNFN8nmI0AqYuemeAlTHKZCEUfZ5sddkeZSIcJygUoRLzEDqoXIRCOQsm/sbONAjRYW5STYl5/xliDMyMTkxbwxBpUswfU52XS1+L60goR8D1N6EDJGucbOxMeDbdeIlV3LUx9AkSVGwDNxgDw3ZLJT6Ul7XON2uZ5tp4BmMe5w6CDsKaClWNj7f6ydpoCZaSyh7zMsFl1+SBgngqQU3zrYztnYwW8RYYw2vOsyFCmuqLsYZUTb3aOv3RZWxmGjBzpXKw5lkY6N45WThOCRCmOckVaCCg6MJsoW/jKRwpR8/VzvFmPffwbIMzXQRUl/0sOUKEjgE6Yke9l/TRDJINPgdiWehSebQndII2iYSot1+IYKY702O0UTDBpe3xx0AXIgnj8mQeCh6M4NaTirPt0k6ogS4WsI8EJTczugjGsWJMNBbR0tKd/tZz4IlMsGUP2TnMfNVyWEeXoso7a3Mf452+BbWuxeWQYt4ZzSZQ8EeQxsAWtb2fwcrR8AjmeGFN4jly4rE9gWdLBYHjgG1MY8fSygBknU7MxwedaoFjT2XvnAihqzzreDBHql87qt7xx1pgq0LiaDSFtgIsFzq6CqZWrkiQpwcvp7sQUxQO2RnmWAxHcI/HwolMij1xk26kQhFnwjLKtFlolp1QrKWIYoYnOINjrCFhNrTFWNEREzwkWHiCE8tVYHieZaHkH+fnwRFuvbOJOieMgBLzWDEdzcCqMIZuPEWYqkPqW7raH5qUajArJN/2PV3KDv64X0dWf+5Rv/QyWsYi3CFhUIFMGBpqrOgYZ5YbQwcJQw9pY2sTU0DXZ2IrWSge5r/hq7z6QjfWzLQvIeQDEwlD0/E6H9+r41eOmutSgXkpApFSi4/kUCsXUTY92Y4QBKp2tFSqE+eY2BJ1IjuS4JkObTxDMAcHJ0e8PplKUICSx8Mi3q4FiMDe0rR0uD1Wsa14APU9n4eiMwHDaNwfW5OZqKtsaTlHGwh4rrveAYzrvUVp7kyiKhyXCE/0veGWh3CTWHh7ZNEE7SEvLG0bzZEzm6AhM4INDqIz3kLedwO1I9n2VEAOw8ZoNg8nCbUyrUZuMjXF4wiNcQdlAHi2JgN3IOGxnBsjZWHRmCdYMQ2z5JEYAzMfSABjy3fueYBQB6nlycoH52BC90CbdQw8g1BkJ+IAy3LjrZklYiAlwNr6u0jUJcfqi8ChAtwkjKhCd7gBvJcV8pwvZYg0wZoURy+LhQgBby5pc4Qhiod9GJ69U5zFrocyGQn+wqN6x8OJbp5nBsi1TeDMjtEGdfwNVK3MnFs5qG3rXoomQI422h64kPey2Q7QTDBdvT9MXzQZIlmdqkBDFM5gRkcmhtqLlvPz95ViYlj2Y3CoLwWsLGpStYo63KU0bhXV+r3xYDSCqmU9Cj2xJQmtbqclCDcbx4BzFT5Z1uJprnrW0wCCx6DKH4JD/VCTqCKs3gZ5sCbVw65ukqBmTeGhL0k9WRT6vX6/f7N6CCtyuPaqzZ6GCKG3/S2kWEM4XdpTAzzpAzAY38rcAIz+/8HqXVhHVVpeuvrmzaUZFdttkMfNzPRo0X+N71m2ql/hAgNdfaxZsE7zdZMcGanygDYPRZWRqm79XixHU/jYJixq32yar06vAdUhVG3r61lVMFoaU2A/Ibh4TBgr64d2+9vDtr4ethVsg3OR33Jpv21FPgr53USLFVv6cYfyt6zYpP9zGwSUFgcSP8XFNkjzmnvk/sbdMRJs35787r+4u2QXti6/7Pv5F9S+X+JeI0QB98jdfZx1FDSjirVKcmm9btm9bPhP5/eH5fHbD8h/5il4bNYJofSFm7/1Fvy3dpjm7TCok0ZNGNcku4Ir05KsgpQ26mJXReTjzrNBoqTg7izCWJqvufpUM7LlkqJml1dk667R+IGzCONYQr5bbLx+ixjlasKar2Pux3dX5E8FxYsOhBc40rxmQR4RjhUcnIAXOCBZpzUj1RWTrxaHlCVXm0Z7V1dtWkQBvWYSHGru27vJrQlrvkw19wHdEe6/L7fydSqNuR9/+Uca94X7lds8c82Ku2tZVz+LVWm+vuN+fjndWzl7ugV+uslZa1MXeePV/f+yvPudm3G/clfEqy3XXP3eBBofSe7t/xSu2Qx2rPgzEWdESlqcuEu94lZFxb1WgStpbosXyrxqBTcccBGpWLpKo4CRViMMatLtcM2Ya3I//fQT9+Mv715hX7ifuR9/eVs2vrwRnN8Kk5ETF+Txt7H+EJJ+UOj/IS9fULlW9W9p+PeFu48tXzj2FaHvoXhxaGbkdIXj3cZRxf7FjV9xfkPy707z5+PrtY5dlPsD1l6Uf1e+MWn8wNnGyPiPbRKcYpL/5wPnEC4nJL4oZFTke1JdakVaX8YjYHE0uCjlISE5dyAcDXZ5lLQaUcCuDL97g/StofzyFv1L/fhyx/3889sU/kQQv5bVXXnDlatJtU8jcsN3WZEyqAj3vo3495qryLZg5L3b9SLXRZQRVrcaLwX5Un1JHoSUcM1mXhy+7vayxa0b/et7WB/uezz/HZjN5qfG/wYAAP//jvFRA0MXAAA="
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_spot_fleet_request.workers_external_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_external_x86" {
      ~ client_token                        = "terraform-20210118204241155800000004" -> (known after apply)
      ~ id                                  = "sfr-cf5c32a2-3323-4b02-afa2-f90656c49b72" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "External worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-04e6df10bd74694e7" -> null
              - version = "8" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-04e6df10bd74694e7"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>

*Pusher: @major, Action: `pull_request`*